annoyedmilk/LogicCard/firmware/ch552_serprog/main.c
    if (usb_send_length > 0)
        usb_send(usb_send_length);

}

void main()
{
    CfgFsys();
    mDelaymS(5);

    // Configure pin 3.2 as LED control
    P3_DIR_PU |= (1 << LED_PIN);
    P3_MOD_OC &= ~(1 << LED_PIN);

    // Configure pin 3.3 as FPGA_EN control (output)
    P3_DIR_PU |= (1 << FPGA_EN_PIN);
    P3_MOD_OC &= ~(1 << FPGA_EN_PIN);

    // Configure pin 1.0 as FPGA_RST control (output initially)
    // SPI pins will be configured on-demand by spi_bus_take_control()
    P1_MOD_OC = 0x00;
    P1_DIR_PU = 0;
    P1_DIR_PU |= (1 << FPGA_RST_PIN);  // Only FPGA_RST as output initially

    // Initialize SPI hardware (but pins remain in high-Z until needed)
    SPI0_SETUP = 0;                                                       //Master模式,高位在前
    SPI0_CTRL = 0x60;                                                     //模式0
    SPI0_CK_SE = 0x02;

    // Initialize FPGA in enabled state with SPI bus released (normal operation)
    spi_bus_release();  // SPI pins in high-Z, FPGA controls the bus
    FPGA_RST = 1;       // Release reset
    FPGA_EN = 1;        // Enable FPGA

    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

    while(!UsbConfig) {
        LED = !LED;
        mDelaymS(50);
    }
    LED = 1; // Turn off LED when USB configured (active low)
    
    while(1)
    {
        handle_command();
        LED = 1; // Turn off LED (active low)
    }
}
